###############################################################################
# Created by write_sdc
# Mon Nov 27 17:28:14 2023
###############################################################################
current_design gpu_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cyc}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[32]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[33]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[34]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[35]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[36]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[37]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[38]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[39]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[40]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[41]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[42]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[43]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[44]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[45]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[46]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[47]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[48]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[49]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[50]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[51]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[52]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[53]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[54]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[55]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[56]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[57]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[58]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[59]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[60]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[61]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[62]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[63]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_in[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mat_idx[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mat_idx[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vector_idx[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vector_idx[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vector_type[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vector_type[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {we}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ack}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[32]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[33]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[34]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[35]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[36]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[37]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[38]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[39]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[40]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[41]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[42]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[43]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[44]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[45]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[46]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[47]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[48]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[49]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[50]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[51]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[52]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[53]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[54]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[55]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[56]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[57]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[58]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[59]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[60]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[61]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[62]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[63]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dat_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {ack}]
set_load -pin_load 0.0729 [get_ports {dat_out[63]}]
set_load -pin_load 0.0729 [get_ports {dat_out[62]}]
set_load -pin_load 0.0729 [get_ports {dat_out[61]}]
set_load -pin_load 0.0729 [get_ports {dat_out[60]}]
set_load -pin_load 0.0729 [get_ports {dat_out[59]}]
set_load -pin_load 0.0729 [get_ports {dat_out[58]}]
set_load -pin_load 0.0729 [get_ports {dat_out[57]}]
set_load -pin_load 0.0729 [get_ports {dat_out[56]}]
set_load -pin_load 0.0729 [get_ports {dat_out[55]}]
set_load -pin_load 0.0729 [get_ports {dat_out[54]}]
set_load -pin_load 0.0729 [get_ports {dat_out[53]}]
set_load -pin_load 0.0729 [get_ports {dat_out[52]}]
set_load -pin_load 0.0729 [get_ports {dat_out[51]}]
set_load -pin_load 0.0729 [get_ports {dat_out[50]}]
set_load -pin_load 0.0729 [get_ports {dat_out[49]}]
set_load -pin_load 0.0729 [get_ports {dat_out[48]}]
set_load -pin_load 0.0729 [get_ports {dat_out[47]}]
set_load -pin_load 0.0729 [get_ports {dat_out[46]}]
set_load -pin_load 0.0729 [get_ports {dat_out[45]}]
set_load -pin_load 0.0729 [get_ports {dat_out[44]}]
set_load -pin_load 0.0729 [get_ports {dat_out[43]}]
set_load -pin_load 0.0729 [get_ports {dat_out[42]}]
set_load -pin_load 0.0729 [get_ports {dat_out[41]}]
set_load -pin_load 0.0729 [get_ports {dat_out[40]}]
set_load -pin_load 0.0729 [get_ports {dat_out[39]}]
set_load -pin_load 0.0729 [get_ports {dat_out[38]}]
set_load -pin_load 0.0729 [get_ports {dat_out[37]}]
set_load -pin_load 0.0729 [get_ports {dat_out[36]}]
set_load -pin_load 0.0729 [get_ports {dat_out[35]}]
set_load -pin_load 0.0729 [get_ports {dat_out[34]}]
set_load -pin_load 0.0729 [get_ports {dat_out[33]}]
set_load -pin_load 0.0729 [get_ports {dat_out[32]}]
set_load -pin_load 0.0729 [get_ports {dat_out[31]}]
set_load -pin_load 0.0729 [get_ports {dat_out[30]}]
set_load -pin_load 0.0729 [get_ports {dat_out[29]}]
set_load -pin_load 0.0729 [get_ports {dat_out[28]}]
set_load -pin_load 0.0729 [get_ports {dat_out[27]}]
set_load -pin_load 0.0729 [get_ports {dat_out[26]}]
set_load -pin_load 0.0729 [get_ports {dat_out[25]}]
set_load -pin_load 0.0729 [get_ports {dat_out[24]}]
set_load -pin_load 0.0729 [get_ports {dat_out[23]}]
set_load -pin_load 0.0729 [get_ports {dat_out[22]}]
set_load -pin_load 0.0729 [get_ports {dat_out[21]}]
set_load -pin_load 0.0729 [get_ports {dat_out[20]}]
set_load -pin_load 0.0729 [get_ports {dat_out[19]}]
set_load -pin_load 0.0729 [get_ports {dat_out[18]}]
set_load -pin_load 0.0729 [get_ports {dat_out[17]}]
set_load -pin_load 0.0729 [get_ports {dat_out[16]}]
set_load -pin_load 0.0729 [get_ports {dat_out[15]}]
set_load -pin_load 0.0729 [get_ports {dat_out[14]}]
set_load -pin_load 0.0729 [get_ports {dat_out[13]}]
set_load -pin_load 0.0729 [get_ports {dat_out[12]}]
set_load -pin_load 0.0729 [get_ports {dat_out[11]}]
set_load -pin_load 0.0729 [get_ports {dat_out[10]}]
set_load -pin_load 0.0729 [get_ports {dat_out[9]}]
set_load -pin_load 0.0729 [get_ports {dat_out[8]}]
set_load -pin_load 0.0729 [get_ports {dat_out[7]}]
set_load -pin_load 0.0729 [get_ports {dat_out[6]}]
set_load -pin_load 0.0729 [get_ports {dat_out[5]}]
set_load -pin_load 0.0729 [get_ports {dat_out[4]}]
set_load -pin_load 0.0729 [get_ports {dat_out[3]}]
set_load -pin_load 0.0729 [get_ports {dat_out[2]}]
set_load -pin_load 0.0729 [get_ports {dat_out[1]}]
set_load -pin_load 0.0729 [get_ports {dat_out[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cyc}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {we}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[63]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[62]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[61]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[60]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[59]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[58]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[57]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[56]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[55]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[54]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[53]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[52]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[51]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[50]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[49]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[48]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[47]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[46]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[45]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[44]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[43]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[42]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[41]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[40]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[39]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[38]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[37]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[36]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[35]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[34]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[33]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[32]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_in[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mat_idx[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mat_idx[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vector_idx[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vector_idx[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vector_type[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vector_type[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
