###############################################################################
# Created by write_sdc
# Mon Nov 20 13:37:55 2023
###############################################################################
current_design interp_tri
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wb_clk_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wb_rst_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_adr_i[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_adr_i[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_cyc_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_dat_i[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_sel_i[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_sel_i[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_sel_i[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_sel_i[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_stb_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_we_i}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_ack_o}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_end[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_start[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {wbs_ack_o}]
set_load -pin_load 0.0729 [get_ports {x_end[7]}]
set_load -pin_load 0.0729 [get_ports {x_end[6]}]
set_load -pin_load 0.0729 [get_ports {x_end[5]}]
set_load -pin_load 0.0729 [get_ports {x_end[4]}]
set_load -pin_load 0.0729 [get_ports {x_end[3]}]
set_load -pin_load 0.0729 [get_ports {x_end[2]}]
set_load -pin_load 0.0729 [get_ports {x_end[1]}]
set_load -pin_load 0.0729 [get_ports {x_end[0]}]
set_load -pin_load 0.0729 [get_ports {x_start[7]}]
set_load -pin_load 0.0729 [get_ports {x_start[6]}]
set_load -pin_load 0.0729 [get_ports {x_start[5]}]
set_load -pin_load 0.0729 [get_ports {x_start[4]}]
set_load -pin_load 0.0729 [get_ports {x_start[3]}]
set_load -pin_load 0.0729 [get_ports {x_start[2]}]
set_load -pin_load 0.0729 [get_ports {x_start[1]}]
set_load -pin_load 0.0729 [get_ports {x_start[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wb_clk_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wb_rst_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_cyc_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_stb_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_we_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_adr_i[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_dat_i[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_sel_i[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
