###############################################################################
# Created by write_sdc
# Thu Nov 23 18:22:59 2023
###############################################################################
current_design tinyrv
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_load_out[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {alu_out_out[31]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[30]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[29]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[28]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[27]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[26]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[25]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[24]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[23]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[22]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[21]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[20]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[19]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[18]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[17]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[16]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[15]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[14]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[13]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[12]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[11]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[10]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[9]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[8]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[7]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[6]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[5]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[4]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[3]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[2]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[1]}]
set_load -pin_load 0.0729 [get_ports {alu_out_out[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_load_out[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
